trade_exp/src/InformationRegisters/ЦеновыеГруппыБезБонусов/ЦеновыеГруппыБезБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6086962b-74f5-4a58-ae6a-5d03ab6b987a">
  <name>ЦеновыеГруппыБезБонусов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="047bb1a5-c6b2-46eb-a0d1-ab19e6518501">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f64f784a-7d5b-472e-8496-3c3b5d0e45f1">
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеновыеГруппыБезБонусов/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличныйДокумент.ФиксацияСверху = 1; 
	
	ШаблонЗаполнения = "даты  действия - это даты в формате дд.мм.гггг. В случае отстуствия даты окончания устанавливается неограниченный срок.";
	ШаблонЗаполненияПродолжение = "Вставить дату в выделенный диапазон ячеек: ";                                       
	ДатаДействия = КонецДня(ТекущаяДата()) + 1;  
	
	ЦветОшибки = WebЦвета.Желтый;    
КонецПроцедуры

#Область Команды 

&НаКлиенте
Процедура Загрузить(Команда)     
	ТаблицаЗначений.Очистить();	
	ЦветФона = Новый Цвет();
	
	НомерСтроки = 2;
	Пока Истина Цикл
		стрНомерСтроки = Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		ДатаНачалаДействияСтрока = СокрЛП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C1").Текст);
		ДатаОкончанияДействияСтрока = СокрЛП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C2").Текст);  
		ЦеноваяГруппа = СокрЛП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C3").Текст); 
		
		Если ПустаяСтрока(ДатаНачалаДействияСтрока) И ПустаяСтрока(ДатаОкончанияДействияСтрока) И ПустаяСтрока(ЦеноваяГруппа)Тогда
			Прервать;
		КонецЕсли;  
		
		ОчиститьОформлениеЯчейки(НомерСтроки, 1, ЦветФона);
		ОчиститьОформлениеЯчейки(НомерСтроки, 2, ЦветФона);
		ОчиститьОформлениеЯчейки(НомерСтроки, 3, ЦветФона);
		
		ЕстьОшибкаВСтроке = Ложь;
		Если ПустаяСтрока(ЦеноваяГруппа) Тогда 
			ПометитьОшибкуВЯчейке(НомерСтроки, 3, "Отсутствует наименование ценовой группы");
			ЕстьОшибкаВСтроке = Истина;
		КонецЕсли; 
		
		Если ПустаяСтрока(ДатаНачалаДействияСтрока) Тогда 
			ПометитьОшибкуВЯчейке(НомерСтроки, 1, "Отсутствует дата начала действия");
			ЕстьОшибкаВСтроке = Истина;
		Иначе
			Попытка
				ДатаНачалаДействия = Дата(Сред(ДатаНачалаДействияСтрока, 7, 4),  Число(Сред(ДатаНачалаДействияСтрока, 4, 2)),  Число(Лев(ДатаНачалаДействияСтрока,2)));
			Исключение      
				ПометитьОшибкуВЯчейке(НомерСтроки, 1, "Неверный формат даты начала действия");
				ЕстьОшибкаВСтроке = Истина;
			КонецПопытки; 
		КонецЕсли;  
		
		Если Не ПустаяСтрока(ДатаОкончанияДействияСтрока) Тогда 		
			Попытка
				ДатаОкончанияДействия = Дата(Сред(ДатаОкончанияДействияСтрока, 7, 4),  Число(Сред(ДатаОкончанияДействияСтрока, 4, 2)),  Число(Лев(ДатаОкончанияДействияСтрока,2)));
				
				Если ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда
					ПометитьОшибкуВЯчейке(НомерСтроки, 2, "Дата окончания действия должна быть больше даты начала");
					ЕстьОшибкаВСтроке = Истина;
				ИначеЕсли ДатаОкончанияДействия < ДатаНачалаДействия Тогда
					ПометитьОшибкуВЯчейке(НомерСтроки, 2, "Дата окончания действия не может быть меньше текущей даты");
					ЕстьОшибкаВСтроке = Истина;
				КонецЕсли;
			Исключение      
				ПометитьОшибкуВЯчейке(НомерСтроки, 2, "Неверный формат даты окончания действия");
				ЕстьОшибкаВСтроке = Истина;
			КонецПопытки;			
		Иначе
			ДатаОкончанияДействия = Дата('00010101');
		КонецЕсли;    
		
		Если Не ЕстьОшибкаВСтроке Тогда  
			СтрутураПоиска = Новый Структура;
			СтрутураПоиска.Вставить("НаименованиеЦеновойГруппы", ЦеноваяГруппа);
			СтрутураПоиска.Вставить("ДатаНачалаДействия", ДатаНачалаДействия);
			СтрутураПоиска.Вставить("ДатаОкончанияДействия", ДатаОкончанияДействия);
			НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(СтрутураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				ПометитьОшибкуВЯчейке(НомерСтроки, 3, "Для этой ценовой группы уже указаны такие же даты начала действия в строке " + НайденныеСтроки[0].НомерСтроки);	
			Иначе 
				СтрокаТЗ = ТаблицаЗначений.Добавить();
				СтрокаТЗ.НомерСтроки = НомерСтроки;
				СтрокаТЗ.НаименованиеЦеновойГруппы = ЦеноваяГруппа;
				СтрокаТЗ.ДатаНачалаДействия = ДатаНачалаДействия;
				СтрокаТЗ.ДатаОкончанияДействия = ДатаОкончанияДействия; 
			КонецЕсли; 			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ЗагрузитьНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура КопироватьДатуНачалаДействия(Команда)
	ДатаСтрока = Формат(ДатаДействия,"ДФ=""дд.ММ.гггг""");
	ВставитьТекстВЯчейку(ДатаСтрока); 
	КопироватьВБуферОбмена(ДатаСтрока)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗагрузитьНаСервере() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаГруппы.НомерСтроки,
		|	ТаблицаГруппы.ДатаНачалаДействия,                     
		|	ТаблицаГруппы.ДатаОкончанияДействия,                     		
		|	ТаблицаГруппы.НаименованиеЦеновойГруппы
		|ПОМЕСТИТЬ втИсходныеГруппы
		|ИЗ
		|	&ТаблицаГруппы КАК ТаблицаГруппы
        |;
        |///////////////////////////////////////////////////////////
        |ВЫБРАТЬ  
		|	втИсходныеГруппы.НомерСтроки,
		|	втИсходныеГруппы.ДатаНачалаДействия КАК Период,                     
		|	втИсходныеГруппы.ДатаОкончанияДействия,                     		
		|	ЦеновыеГруппы.Ссылка КАК ЦеноваяГруппа,
		|	ВЫБОР 
		|		КОГДА
		|			ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1) 
		|		ТОГДА
		|			ДАТАВРЕМЯ(3000, 1, 1)
		|	ИНАЧЕ                    
		|		ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияЗакрытая,
		|	ВЫБОР 
		|		КОГДА ЦеновыеГруппы.Ссылка ЕСТЬ NULL
		|		ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Ошибка			
		|ПОМЕСТИТЬ
		|	втПроверкаЦеновыхГрупп
	    |ИЗ 
        | 	втИсходныеГруппы 
        |ЛЕВОЕ СОЕДИНЕНИЕ
        | 	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
        |ПО
        | 	втИсходныеГруппы.НаименованиеЦеновойГруппы = ЦеновыеГруппы.Наименование
        |;    
        | 
       	|///////////////////////////////////////////////////////////  
        |ВЫБРАТЬ  
		|	НомерСтроки
        |ИЗ
        | 	втПроверкаЦеновыхГрупп
		|ГДЕ
		|	Ошибка = 1	
		|;    
       	|///////////////////////////////////////////////////////////  
		|ВЫБРАТЬ   
		|	НомерСтроки,
		|	Период,                     
		|	ДатаОкончанияДействия,                     		
		|	ЦеноваяГруппа,		
		|	ДатаОкончанияЗакрытая
		|ПОМЕСТИТЬ              
		|	втЕстьЦеновыеГруппы
		|ИЗ			
		|	втПроверкаЦеновыхГрупп
		|ГДЕ
		|	Ошибка = 0
		|;    
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ   
		|	втЕстьЦеновыеГруппы.НомерСтроки,
		|	втЕстьЦеновыеГруппы.Период,                     
		|	втЕстьЦеновыеГруппы.ДатаОкончанияДействия,                     		
		|	втЕстьЦеновыеГруппы.ЦеноваяГруппа,		
		|	втЕстьЦеновыеГруппы.ДатаОкончанияЗакрытая,
		|	МАКСИМУМ(втОстальныеСтроки.НомерСтроки) КАК НомерСтрокиПериодаПересечения
		|ПОМЕСТИТЬ              
		|	втПроверкаПересеченияВЗагрузке
		|ИЗ			
		|	втЕстьЦеновыеГруппы
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ 
		|		НомерСтроки,
		|		Период,                     
		|		ЦеноваяГруппа,		
		|		ДатаОкончанияЗакрытая
		|	ИЗ                 
		|		втЕстьЦеновыеГруппы
		|	) КАК втОстальныеСтроки
		|ПО	
		|	втЕстьЦеновыеГруппы.ЦеноваяГруппа = втОстальныеСтроки.ЦеноваяГруппа
		|	И втЕстьЦеновыеГруппы.Период <> втОстальныеСтроки.Период
		|	И  ((втЕстьЦеновыеГруппы.Период >= втОстальныеСтроки.Период
		|			И втЕстьЦеновыеГруппы.Период <= втОстальныеСтроки.ДатаОкончанияЗакрытая)
		|				ИЛИ 	
		|		(втЕстьЦеновыеГруппы.ДатаОкончанияЗакрытая >= втОстальныеСтроки.Период
		|			И втЕстьЦеновыеГруппы.ДатаОкончанияЗакрытая <= втОстальныеСтроки.ДатаОкончанияЗакрытая))
		|СГРУППИРОВАТЬ ПО
		|	втЕстьЦеновыеГруппы.НомерСтроки,
		|	втЕстьЦеновыеГруппы.Период,                     
		|	втЕстьЦеновыеГруппы.ДатаОкончанияДействия,                     		
		|	втЕстьЦеновыеГруппы.ЦеноваяГруппа,		
		|	втЕстьЦеновыеГруппы.ДатаОкончанияЗакрытая
		|;    
       	|///////////////////////////////////////////////////////////   
        |ВЫБРАТЬ  
		|	НомерСтроки, НомерСтрокиПериодаПересечения
        |ИЗ
        | 	втПроверкаПересеченияВЗагрузке
		|ГДЕ
		|	НомерСтрокиПериодаПересечения ЕСТЬ НЕ NULL		 
		|;    
       	|///////////////////////////////////////////////////////////   		
        |ВЫБРАТЬ  
		|	НомерСтроки, 
		|	Период,                     
		|	ДатаОкончанияДействия,                     		
		|	ЦеноваяГруппа,		
		|	ДатаОкончанияЗакрытая              
		|ПОМЕСТИТЬ
		|	втНетПересеченийВЗагрузке
        |ИЗ
        | 	втПроверкаПересеченияВЗагрузке
		|ГДЕ
		|	НомерСтрокиПериодаПересечения ЕСТЬ NULL		 
		|;    
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ 
		|	ЦеновыеГруппыБезБонусов.ЦеноваяГруппа, 
		|	ЦеновыеГруппыБезБонусов.Период, 
		|	ЦеновыеГруппыБезБонусов.ДатаОкончанияДействия,
		|	ВЫБОР 
		|		КОГДА
		|			ЦеновыеГруппыБезБонусов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1) 
		|		ТОГДА
		|			ДАТАВРЕМЯ(3000, 1, 1)
		|	ИНАЧЕ                    
		|		ЦеновыеГруппыБезБонусов.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияЗакрытая
		|ПОМЕСТИТЬ
		|	втРегистрЦеновыхГрупп  
		|ИЗ
		|	РегистрСведений.ЦеновыеГруппыБезБонусов КАК ЦеновыеГруппыБезБонусов
		|СОЕДИНЕНИЕ 
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ЦеноваяГруппа КАК ЦеноваяГруппа
		|	ИЗ втНетПересеченийВЗагрузке) КАК втНетПересеченийВЗагрузке
		|ПО ЦеновыеГруппыБезБонусов.ЦеноваяГруппа = втНетПересеченийВЗагрузке.ЦеноваяГруппа
		|;    
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ  
		|	втНетПересеченийВЗагрузке.НомерСтроки 
		|ПОМЕСТИТЬ
		|	втДобавлениеСтарыхПериодов	
		|ИЗ
		|	втНетПересеченийВЗагрузке
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	втРегистрЦеновыхГрупп 
		|ПО  втНетПересеченийВЗагрузке.ЦеноваяГруппа = втРегистрЦеновыхГрупп.ЦеноваяГруппа
		|	И втНетПересеченийВЗагрузке.Период = втРегистрЦеновыхГрупп.Период
		|ГДЕ 
		|	втНетПересеченийВЗагрузке.Период < &ТекущаяДата
		|	И  втРегистрЦеновыхГрупп.Период ЕСТЬ NULL   
		|;    
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ  
		|	НомерСтроки 
		|ИЗ
		|	втДобавлениеСтарыхПериодов   
		|;    
       	|///////////////////////////////////////////////////////////   
	    |ВЫБРАТЬ  
		|	втНетПересеченийВЗагрузке.НомерСтроки, 
		|	втНетПересеченийВЗагрузке.Период,                     
		|	втНетПересеченийВЗагрузке.ДатаОкончанияДействия,                     		
		|	втНетПересеченийВЗагрузке.ЦеноваяГруппа,		
		|	втНетПересеченийВЗагрузке.ДатаОкончанияЗакрытая              
		|ПОМЕСТИТЬ
		|	втПроверенныеГруппы
		|ИЗ
		|	втНетПересеченийВЗагрузке 
		|ЛЕВОЕ СОЕДИНЕНИЕ  
		|	втДобавлениеСтарыхПериодов
		|ПО втНетПересеченийВЗагрузке.НомерСтроки = втДобавлениеСтарыхПериодов.НомерСтроки
		|ГДЕ
		| втДобавлениеСтарыхПериодов.НомерСтроки ЕСТЬ NULL
		|;    
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ   
		|	втПроверенныеГруппы.НомерСтроки,
		|	втПроверенныеГруппы.Период,                     
		|	втПроверенныеГруппы.ДатаОкончанияДействия,                     		
		|	втПроверенныеГруппы.ЦеноваяГруппа,		
		|	втПроверенныеГруппы.ДатаОкончанияЗакрытая,
		|	МАКСИМУМ(втРегистрЦеновыхГрупп.Период) КАК ПериодРегистра
		|ПОМЕСТИТЬ
		|	втПроверкаПересеченияВРегистре
		|ИЗ         
		|   втПроверенныеГруппы
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	втРегистрЦеновыхГрупп		
		|ПО	
		|	втПроверенныеГруппы.ЦеноваяГруппа = втРегистрЦеновыхГрупп.ЦеноваяГруппа
		|	И втПроверенныеГруппы.Период <> втРегистрЦеновыхГрупп.Период
		|	И  ((втПроверенныеГруппы.Период >= втРегистрЦеновыхГрупп.Период
		|			И втПроверенныеГруппы.Период <= втРегистрЦеновыхГрупп.ДатаОкончанияЗакрытая)
		|				ИЛИ 	
		|		(втПроверенныеГруппы.ДатаОкончанияЗакрытая >= втРегистрЦеновыхГрупп.Период
		|			И втПроверенныеГруппы.ДатаОкончанияЗакрытая <= втРегистрЦеновыхГрупп.ДатаОкончанияЗакрытая))
		|СГРУППИРОВАТЬ ПО
		|	втПроверенныеГруппы.НомерСтроки,
		|	втПроверенныеГруппы.Период,                     
		|	втПроверенныеГруппы.ДатаОкончанияДействия,                     		
		|	втПроверенныеГруппы.ЦеноваяГруппа,		
		|	втПроверенныеГруппы.ДатаОкончанияЗакрытая 
		|;    
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ 
		|	втПроверкаПересеченияВРегистре.НомерСтроки,
		|	втРегистрЦеновыхГрупп.Период,
		|	втРегистрЦеновыхГрупп.ДатаОкончанияДействия		
		|ИЗ 
		|	втПроверкаПересеченияВРегистре 
		|СОЕДИНЕНИЕ  
		|	втРегистрЦеновыхГрупп
		|ПО втПроверкаПересеченияВРегистре.ЦеноваяГруппа = втРегистрЦеновыхГрупп.ЦеноваяГруппа                                
		|	И втПроверкаПересеченияВРегистре.ПериодРегистра = втРегистрЦеновыхГрупп.Период
		|;
       	|///////////////////////////////////////////////////////////   
		|ВЫБРАТЬ 
		|	НомерСтроки,
		|	Период,
		|	ДатаОкончанияДействия,
		|	ЦеноваяГруппа			
		|ИЗ 
		|	втПроверкаПересеченияВРегистре 
		|ГДЕ ПериодРегистра ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаГруппы", ТаблицаЗначений.Выгрузить()); 
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();        

	Выборка = МассивРезультатов[2].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПометитьОшибкуВЯчейке(Выборка.НомерСтроки, 3, "Нет такой ценовой группы в справочнике ценовых групп");
	КонецЦикла;       
	
	Выборка = МассивРезультатов[5].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПометитьОшибкуВЯчейке(Выборка.НомерСтроки, 2, "Период пересекается с периодом в строке " + Строка(Выборка.НомерСтрокиПериодаПересечения));
	КонецЦикла;   
	
	Выборка = МассивРезультатов[9].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПометитьОшибкуВЯчейке(Выборка.НомерСтроки, 1, "Добавление нового периода не может начинаться с даты меньше текущей");
	КонецЦикла;
	
	Выборка = МассивРезультатов[12].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПометитьОшибкуВЯчейке(Выборка.НомерСтроки, 1, "Период пересекается с периодом в регистре " 
		+ Формат(Выборка.Период, "ДЛФ=D") + " - " 
		+ ?(Выборка.ДатаОкончанияДействия <> Дата("30000101"), Формат(Выборка.ДатаОкончанияДействия, "ДЛФ=D"), "Не ограничено"));
	КонецЦикла;
	
	
	Выборка = МассивРезультатов[13].Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЦеновыеГруппыБезБонусов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период); 
		НаборЗаписей.Отбор.ЦеноваяГруппа.Установить(Выборка.ЦеноваяГруппа); 

		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Период = Выборка.Период;
		НоваяЗапись.ЦеноваяГруппа = Выборка.ЦеноваяГруппа;
		НоваяЗапись.ДатаОкончанияДействия = Выборка.ДатаОкончанияДействия;
		НаборЗаписей.Записать();
	КонецЦикла;  

	Сообщить("Загрузка выполнена");
КонецПроцедуры

Процедура ПометитьОшибкуВЯчейке(НомерСтроки, НомерКолонки, Текстошибки)
	ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧРГ=; ЧГ=0") + "C" + Формат(НомерКолонки, "ЧРГ=; ЧГ=0")).ЦветФона = ЦветОшибки;			
	ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧРГ=; ЧГ=0") + "C" + Формат(НомерКолонки, "ЧРГ=; ЧГ=0")).Примечание.Текст = ТекстОшибки;
КонецПроцедуры

Процедура ОчиститьОформлениеЯчейки(НомерСтроки, НомерКолонки, ЦветФона)
	ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧРГ=; ЧГ=0") + "C" + Формат(НомерКолонки, "ЧРГ=; ЧГ=0")).ЦветФона = ЦветФона;			
	ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧРГ=; ЧГ=0") + "C" + Формат(НомерКолонки, "ЧРГ=; ЧГ=0")).Примечание.Текст = "";
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВБуферОбмена(Текст)
	ОбъектКопирования = Новый COMОбъект("htmlfile"); 
	ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", Текст);     
КонецПроцедуры  

&НаКлиенте
Процедура ВставитьТекстВЯчейку(Текст)    
	
	ДатаНачалаВДиапазоне = (ТабличныйДокумент.ТекущаяОбласть.Лево = 1);
	ДатаОкончанияВДиапазоне = ((ТабличныйДокумент.ТекущаяОбласть.Лево <= 2) И (ТабличныйДокумент.ТекущаяОбласть.Право >= 2));
	
	Если ДатаНачалаВДиапазоне Или ДатаОкончанияВДиапазоне Тогда
		Для СчВерт = ТабличныйДокумент.ТекущаяОбласть.Верх По ТабличныйДокумент.ТекущаяОбласть.Низ Цикл  
			
			Если ДатаНачалаВДиапазоне Тогда
				АктивнаяЯчейка = ТабличныйДокумент.Область(СчВерт, 1, СчВерт, 1);	
				АктивнаяЯчейка.Текст = Текст;   
			КонецЕсли;   
			Если ДатаОкончанияВДиапазоне Тогда
				АктивнаяЯчейка = ТабличныйДокумент.Область(СчВерт, 2, СчВерт, 2);	
				АктивнаяЯчейка.Текст = Текст;   
			КонецЕсли;
		КонецЦикла;
	Иначе
		Сообщить("Дату необходимо вставлять в колонку 1 или 2");	
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОповеститьОВыборе(Истина);
КонецПроцедуры

#КонецОбласти
